giveaway_rails/app/controllers/categories_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
    def index
        if params[:item_id]
            item = Item.find(params[:item_id])
            render json: {categories: item.categories}
        else
            render json: {categories: Category.all}

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        id = params[:id]
        render json: {category: Category.find(id)}