giveaway_rails/app/controllers/items_controller.rb

    def index
      if params[:category_id]
        ids = params[:category_id].to_s.split("").map(&:to_i)
        render json: {items: Item.includes(:categories).where(categories: {id: ids}).order({created_at: :desc})}
      else
        render json: {items: Item.all.order({created_at: :desc})}
---
SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC

    def show
        id = params[:id]
        render json: {item: Item.find(id)}
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

    def create
      new_item = Item.new("name": item_params["name"], "description": item_params["description"],"image_url": item_params["image_url"], "address": item_params["address"], "user_id": item_params["user_id"]  )
        if new_item.save
          item = Item.last
          categories = item_params["categories"].split("").map(&:to_i)
          categories.map{|c| item.categories << Category.find(c)}
---
INSERT INTO "items" ("name", "description", "image_url", "address", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 6]]
INSERT INTO "categories_items" ("category_id", "item_id") VALUES ($1, $2)  [["category_id", 1], ["item_id", 26]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      item = Item.find(params[:id])
        if item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "Helo"], ["updated_at", "2018-09-07 20:11:10.946811"], ["id", 26]]

    def destroy
        item = Item.find(params[:id])
        item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 30]]