giveaway_rails/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 ORDER BY "items"."created_at" DESC  [["user_id", 6]]
---
  def getItems
    id = params[:id]
    render json: {items: User.find(id).items}